group-reports/test-phase/results/disk-throughput-tuning-protocol-C/test-5.txt
readwrite-randomly-test-job: (g=0): rw=randrw, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
...
fio-3.7
Starting 16 processes
readwrite-randomly-test-job: Laying out IO file (1 file / 10240MiB)

readwrite-randomly-test-job: (groupid=0, jobs=16): err= 0: pid=24362: Sun Jul  9 10:52:20 2023
   read: IOPS=200, BW=1601KiB/s (1639kB/s)(940MiB/601279msec)
    slat (usec): min=4, max=57116, avg=104.31, stdev=541.09
    clat (msec): min=11, max=2733, avg=1270.08, stdev=64.37
     lat (msec): min=11, max=2733, avg=1270.19, stdev=64.38
    clat percentiles (msec):
     |  1.00th=[ 1070],  5.00th=[ 1250], 10.00th=[ 1267], 20.00th=[ 1267],
     | 30.00th=[ 1267], 40.00th=[ 1267], 50.00th=[ 1267], 60.00th=[ 1284],
     | 70.00th=[ 1284], 80.00th=[ 1284], 90.00th=[ 1284], 95.00th=[ 1284],
     | 99.00th=[ 1318], 99.50th=[ 1334], 99.90th=[ 1955], 99.95th=[ 2140],
     | 99.99th=[ 2400]
   bw (  KiB/s): min=   15, max=  384, per=6.24%, avg=99.82, stdev=41.57, samples=19159
   iops        : min=    1, max=   48, avg=12.13, stdev= 5.22, samples=19159
  write: IOPS=85, BW=687KiB/s (704kB/s)(403MiB/601279msec)
    slat (usec): min=6, max=1437.3k, avg=612.52, stdev=16030.41
    clat (msec): min=2, max=1750, avg=19.93, stdev=69.53
     lat (msec): min=3, max=1750, avg=20.55, stdev=72.69
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[    6], 10.00th=[    6], 20.00th=[    7],
     | 30.00th=[    8], 40.00th=[    9], 50.00th=[   10], 60.00th=[   12],
     | 70.00th=[   13], 80.00th=[   16], 90.00th=[   21], 95.00th=[   32],
     | 99.00th=[  268], 99.50th=[  506], 99.90th=[ 1053], 99.95th=[ 1167],
     | 99.99th=[ 1485]
   bw (  KiB/s): min=   14, max=  272, per=7.41%, avg=50.89, stdev=33.55, samples=16103
   iops        : min=    1, max=   34, avg= 6.02, stdev= 4.23, samples=16103
  lat (msec)   : 4=0.11%, 10=15.36%, 20=11.34%, 50=2.20%, 100=0.32%
  lat (msec)   : 250=0.44%, 500=0.21%, 750=0.12%, 1000=0.39%
  cpu          : usr=0.07%, sys=0.20%, ctx=172186, majf=0, minf=161
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.9%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=120315,51640,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=1601KiB/s (1639kB/s), 1601KiB/s-1601KiB/s (1639kB/s-1639kB/s), io=940MiB (986MB), run=601279-601279msec
  WRITE: bw=687KiB/s (704kB/s), 687KiB/s-687KiB/s (704kB/s-704kB/s), io=403MiB (423MB), run=601279-601279msec

Disk stats (read/write):
    drbd1: ios=120315/51680, merge=0/0, ticks=152578940/1040624, in_queue=153619564, util=99.20%, aggrios=120315/51720, aggrmerge=0/0, aggrticks=152593740/321745, aggrin_queue=152915485, aggrutil=90.76%
    dm-0: ios=120315/51720, merge=0/0, ticks=152593740/321745, in_queue=152915485, util=90.76%, aggrios=120315/51720, aggrmerge=0/0, aggrticks=152595172/320784, aggrin_queue=152829659, aggrutil=90.81%
  vdb: ios=120315/51720, merge=0/0, ticks=152595172/320784, in_queue=152829659, util=90.81%